Revit 2027 API
FilterStringBeginsWith Methods
The FilterStringBeginsWith type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from FilterStringRuleEvaluator)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Evaluate |  Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not.
(Inherited from FilterStringRuleEvaluator)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FilterStringBeginsWith Class
Autodesk.Revit.DB Namespace